#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.cloudwatch_logs.aws_cloudwatch_log_group.logs: Refreshing state... [id=/machamp/staging/ecs]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-09d8ac12538411d38]
module.rds.aws_db_option_group.this: Refreshing state... [id=machamp-staging]
module.rds.aws_db_parameter_group.this: Refreshing state... [id=machamp-staging]
module.ecs.module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-task-execution]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=staging]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::762742784206:policy/ecs-task-execution]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20210610143606158400000001]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0f47b5557a518ee32]
module.network.aws_route_table.public: Refreshing state... [id=rtb-014dceecc7f6c7308]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-04f4a7b400769581c]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-09fd540a6c087b413]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-04c459391a247e0ab]
module.db_sg.aws_security_group.this: Refreshing state... [id=sg-0e7f2b8890b526257]
module.ecs_task_sg.aws_security_group.this: Refreshing state... [id=sg-0222494618a313746]
module.alb_sg.aws_security_group.this: Refreshing state... [id=sg-020543f2815ffa99c]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0320d2046da4cfbfb]
module.db_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-397310042]
module.db_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-60673694]
module.ecs_task_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1539816377]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=machamp-staging-subnet-group]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-04683019cbec84469]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0693399967cb7053a]
module.network.aws_route.public: Refreshing state... [id=r-rtb-014dceecc7f6c73081080289494]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3734123320]
module.alb_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2648273947]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-241983885]
module.ecs_task_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3088096676]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/1f5515693a0c4186]
module.rds.aws_db_instance.this: Refreshing state... [id=machamp-staging-db]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/b9836f3fbc9d3a12]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/1f5515693a0c4186/a9ba296c834b7347]
module.ecs.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.service must be replaced
-/+ resource "aws_ecs_service" "service" {
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service" -> (known after apply)
        name                               = "machamp-staging-service"
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (12 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      ~ deployment_controller {
          ~ type = "ECS" -> "CODE_DEPLOY" # forces replacement
        }


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>